Rechnerubung/Week9/droplet_impact/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
/*AxiSymmetric mesh!
   
x =R*cos (theta/2)
y =R*sin (theta/2)    theta = angle!!!!!!!!

R=1 , theta= 5 degree */
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
convertToMeters 1;
 
vertices
(
(0 		0 		0)  //0
(0.002 	0.00001 	0) //1
(0.002 	0.00001 	0.004) //2
(0 		0 		0.004) //3
(0.002 -0.00001 	0) //4  
(0.002 -0.00001 	0.004) //5
);
 
blocks
(

hex (0 4 1 0 3 5 2 3) (40 1 80) simpleGrading (1 1 1)
);
 
edges
(
);
 
boundary
(
    front
    {
        type wedge;
        faces
        (
             (0 1 2 3)
        );
    }

    back
    {
        type wedge;
        faces
        (
            (0 3 5 4)
        );
    }

    side
    {
        type wall;
        faces
        (
            (1 4 5 2)
        );
    }

    top
    {
        type patch;
        faces
        (
             (2 5 3 3)
        );
    }
	
    bottom
    {
        type patch;
        faces
        (
            (0 4 1 0)
        );
    }

    axis
    {
        type empty;
        faces
        (
             (0 3 3 0)
        );
    }
);

mergePatchPairs
(
);

 

