Rechnerubung/Week9/droplet_impact/0/U.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    
    front    
    {
        type            wedge;
    }

    back
    {
        type            wedge;
    }

    side
    { 
	type		zeroGradient;  
    }
    bottom
	{
	type 	fixedValue;
	value 	uniform (0 0 0);
	}
    top
    {
	type 	fixedValue;
	value 	uniform (0 0 0);
	}
   axis            
    {
	type		empty;
    }
    	
}


// ************************************************************************* //
