Rechnerubung/Week9/droplet_impact/0/alpha.water.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    
    front    
    {
        type            wedge;
    }

    back
    {
        type            wedge;
    }

    side
    { 
		type		zeroGradient;  
    }
    bottom
	{
		type 	constantAlphaContactAngle ;
		limit 	zeroGradient ;
		theta0 	150;
		value 	uniform 0;
	}
    top
    {
		type		zeroGradient;  
	}
   axis            
    {
		type		empty;
    }
    	
}


// ************************************************************************* //
