Rechnerubung/Week9/droplet_impact/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0.0
);

regions
(
    sphereToCell
    {
        centre (0 0 0.001);
        radius 0.0005;
        fieldValues
        (
            volScalarFieldValue alpha.water 1.0
           	volVectorFieldValue U (0 0 -1)
        );
    }
);


// ************************************************************************* //
